/*************************************************************************
    > File Name: jingdian3.c
    > Author: ma6174
    > Mail: ma6174@163.com 
    > Created Time: 2016年03月23日 星期三 22时13分57秒
 ************************************************************************/
/*一个数加上１００是完全平方数，加上１６８又是完全平方数*/
#include<stdio.h>
#include <math.h>
void main(){
	int x,y;
	long int i;
	for (i=1;i<=1000000;i++){
		x=sqrt(i+100);
		y=sqrt(i+168);
		if (x*x==(i+100)&&y*y==(i+168))
			printf("%ld\n",i);
	}
}

